ravynsoft/ravynos/gnu/usr.bin/binutils/bfd/elf32-rl78.c
/* Renesas RL78 specific support for 32-bit ELF.
   Copyright (C) 2011-2023 Free Software Foundation, Inc.

   This file is part of BFD, the Binary File Descriptor library.

   This program is free software; you can redistribute it and/or modify
   it under the terms of the GNU General Public License as published by
   the Free Software Foundation; either version 3 of the License, or
   (at your option) any later version.

   This program is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU General Public License for more details.

   You should have received a copy of the GNU General Public License
   along with this program; if not, write to the Free Software
   Foundation, Inc., 51 Franklin Street - Fifth Floor, Boston,
   MA 02110-1301, USA.  */

#include "sysdep.h"
#include "bfd.h"
#include "libbfd.h"
#include "elf-bfd.h"
#include "elf/rl78.h"
#include "libiberty.h"

#define valid_16bit_address(v) ((v) <= 0x0ffff || (v) >= 0xf0000)

#define RL78REL(n,sz,bit,mask,shift,complain,pcrel) \
  HOWTO (R_RL78_##n, shift, sz, bit, pcrel, 0, complain_overflow_ ## complain, \
	 bfd_elf_generic_reloc, "R_RL78_" #n, false, 0, mask, false)

static bfd_reloc_status_type rl78_special_reloc (bfd *, arelent *, asymbol *, void *,
						 asection *, bfd *, char **);

#define RL78_OP_REL(n,sz,bit,mask,shift,complain,pcrel)			\
  HOWTO (R_RL78_##n, shift, sz, bit, pcrel, 0, complain_overflow_ ## complain, \
	 rl78_special_reloc, "R_RL78_" #n, false, 0, mask, false)

/* Note that the relocations around 0x7f are internal to this file;
   feel free to move them as needed to avoid conflicts with published
   relocation numbers.  */

static reloc_howto_type rl78_elf_howto_table [] =
{
  RL78REL (NONE,	 0,  0, 0,          0, dont,     false),
  RL78REL (DIR32,	 4, 32, 0xffffffff, 0, dont,     false),
  RL78REL (DIR24S,	 4, 24, 0xffffff,   0, signed,   false),
  RL78REL (DIR16,	 2, 16, 0xffff,     0, bitfield, false),
  RL78REL (DIR16U,	 2, 16, 0xffff,     0, unsigned, false),
  RL78REL (DIR16S,	 2, 16, 0xffff,     0, bitfield, false),
  RL78REL (DIR8,	 1,  8, 0xff,       0, dont,     false),
  RL78REL (DIR8U,	 1,  8, 0xff,       0, unsigned, false),
  RL78REL (DIR8S,	 1,  8, 0xff,       0, bitfield, false),
  RL78REL (DIR24S_PCREL, 4, 24, 0xffffff,   0, signed,   true),
  RL78REL (DIR16S_PCREL, 2, 16, 0xffff,     0, signed,   true),
  RL78REL (DIR8S_PCREL,	 1,  8, 0xff,       0, signed,   true),
  RL78REL (DIR16UL,	 2, 16, 0xffff,     2, unsigned, false),
  RL78REL (DIR16UW,	 2, 16, 0xffff,     1, unsigned, false),
  RL78REL (DIR8UL,	 1,  8, 0xff,       2, unsigned, false),
  RL78REL (DIR8UW,	 1,  8, 0xff,       1, unsigned, false),
  RL78REL (DIR32_REV,	 4, 32, 0xffffffff, 0, dont,     false),
  RL78REL (DIR16_REV,	 2, 16, 0xffff,     0, bitfield, false),
  RL78REL (DIR3U_PCREL,	 1,  3, 0x7,        0, unsigned, true),

  EMPTY_HOWTO (0x13),
  EMPTY_HOWTO (0x14),
  EMPTY_HOWTO (0x15),
  EMPTY_HOWTO (0x16),
  EMPTY_HOWTO (0x17),
  EMPTY_HOWTO (0x18),
  EMPTY_HOWTO (0x19),
  EMPTY_HOWTO (0x1a),
  EMPTY_HOWTO (0x1b),
  EMPTY_HOWTO (0x1c),
  EMPTY_HOWTO (0x1d),
  EMPTY_HOWTO (0x1e),
  EMPTY_HOWTO (0x1f),

  EMPTY_HOWTO (0x20),
  EMPTY_HOWTO (0x21),
  EMPTY_HOWTO (0x22),
  EMPTY_HOWTO (0x23),
  EMPTY_HOWTO (0x24),
  EMPTY_HOWTO (0x25),
  EMPTY_HOWTO (0x26),
  EMPTY_HOWTO (0x27),
  EMPTY_HOWTO (0x28),
  EMPTY_HOWTO (0x29),
  EMPTY_HOWTO (0x2a),
  EMPTY_HOWTO (0x2b),
  EMPTY_HOWTO (0x2c),

  RL78REL (RH_RELAX,	 0,  0, 0,          0, dont,	 false),
  RL78REL (RH_SFR,	 1,  8, 0xff,       0, unsigned, false),
  RL78REL (RH_SADDR,	 1,  8, 0xff,       0, unsigned, false),

  EMPTY_HOWTO (0x30),
  EMPTY_HOWTO (0x31),
  EMPTY_HOWTO (0x32),
  EMPTY_HOWTO (0x33),
  EMPTY_HOWTO (0x34),
  EMPTY_HOWTO (0x35),
  EMPTY_HOWTO (0x36),
  EMPTY_HOWTO (0x37),
  EMPTY_HOWTO (0x38),
  EMPTY_HOWTO (0x39),
  EMPTY_HOWTO (0x3a),
  EMPTY_HOWTO (0x3b),
  EMPTY_HOWTO (0x3c),
  EMPTY_HOWTO (0x3d),
  EMPTY_HOWTO (0x3e),
  EMPTY_HOWTO (0x3f),
  EMPTY_HOWTO (0x40),

  RL78_OP_REL (ABS32,	     4, 32, 0xffffffff, 0, dont,	false),
  RL78_OP_REL (ABS24S,	     4, 24, 0xffffff,   0, signed,	false),
  RL78_OP_REL (ABS16,	     2, 16, 0xffff,     0, bitfield,	false),
  RL78_OP_REL (ABS16U,	     2, 16, 0xffff,     0, unsigned,	false),
  RL78_OP_REL (ABS16S,	     2, 16, 0xffff,     0, signed,	false),
  RL78_OP_REL (ABS8,	     1,	 8, 0xff,       0, bitfield,	false),
  RL78_OP_REL (ABS8U,	     1,	 8, 0xff,       0, unsigned,	false),
  RL78_OP_REL (ABS8S,	     1,	 8, 0xff,       0, signed,	false),
  RL78_OP_REL (ABS24S_PCREL, 4, 24, 0xffffff,   0, signed,	true),
  RL78_OP_REL (ABS16S_PCREL, 2, 16, 0xffff,     0, signed,	true),
  RL78_OP_REL (ABS8S_PCREL,  1,	 8, 0xff,       0, signed,	true),
  RL78_OP_REL (ABS16UL,	     2, 16, 0xffff,     0, unsigned,	false),
  RL78_OP_REL (ABS16UW,	     2, 16, 0xffff,     0, unsigned,	false),
  RL78_OP_REL (ABS8UL,	     1,	 8, 0xff,       0, unsigned,	false),
  RL78_OP_REL (ABS8UW,	     1,	 8, 0xff,       0, unsigned,	false),
  RL78_OP_REL (ABS32_REV,    4, 32, 0xffffffff, 0, dont,	false),
  RL78_OP_REL (ABS16_REV,    2, 16, 0xffff,     0, bitfield,	false),

#define STACK_REL_P(x) ((x) <= R_RL78_ABS16_REV && (x) >= R_RL78_ABS32)

  EMPTY_HOWTO (0x52),
  EMPTY_HOWTO (0x53),
  EMPTY_HOWTO (0x54),
  EMPTY_HOWTO (0x55),
  EMPTY_HOWTO (0x56),
  EMPTY_HOWTO (0x57),
  EMPTY_HOWTO (0x58),
  EMPTY_HOWTO (0x59),
  EMPTY_HOWTO (0x5a),
  EMPTY_HOWTO (0x5b),
  EMPTY_HOWTO (0x5c),
  EMPTY_HOWTO (0x5d),
  EMPTY_HOWTO (0x5e),
  EMPTY_HOWTO (0x5f),
  EMPTY_HOWTO (0x60),
  EMPTY_HOWTO (0x61),
  EMPTY_HOWTO (0x62),
  EMPTY_HOWTO (0x63),
  EMPTY_HOWTO (0x64),
  EMPTY_HOWTO (0x65),
  EMPTY_HOWTO (0x66),
  EMPTY_HOWTO (0x67),
  EMPTY_HOWTO (0x68),
  EMPTY_HOWTO (0x69),
  EMPTY_HOWTO (0x6a),
  EMPTY_HOWTO (0x6b),
  EMPTY_HOWTO (0x6c),
  EMPTY_HOWTO (0x6d),
  EMPTY_HOWTO (0x6e),
  EMPTY_HOWTO (0x6f),
  EMPTY_HOWTO (0x70),
  EMPTY_HOWTO (0x71),
  EMPTY_HOWTO (0x72),
  EMPTY_HOWTO (0x73),
  EMPTY_HOWTO (0x74),
  EMPTY_HOWTO (0x75),
  EMPTY_HOWTO (0x76),
  EMPTY_HOWTO (0x77),

