ravynsoft/ravynos/gnu/usr.bin/binutils/bfd/elf32-rl78.c
  switch (r_type)
    {
    default:
      status = bfd_reloc_notsupported;
      break;

    case R_RL78_ABS24S_PCREL:
    case R_RL78_ABS16S_PCREL:
    case R_RL78_ABS8S_PCREL:
      relocation = rl78_stack_pop (&status);
      relocation -= input_section->output_section->vma + input_section->output_offset;
      break;

    case R_RL78_ABS32:
    case R_RL78_ABS32_REV:
    case R_RL78_ABS16:
    case R_RL78_ABS16_REV:
    case R_RL78_ABS16S:
    case R_RL78_ABS16U:
    case R_RL78_ABS8:
    case R_RL78_ABS8U:
    case R_RL78_ABS8S:
      relocation = rl78_stack_pop (&status);
      break;

    case R_RL78_ABS16UL:
    case R_RL78_ABS8UL:
      relocation = rl78_stack_pop (&status) >> 2;
      break;;

    case R_RL78_ABS16UW:
    case R_RL78_ABS8UW:
      relocation = rl78_stack_pop (&status) >> 1;
      break;

      /* The rest of the relocs compute values and then push them onto the stack.  */
    case R_RL78_OPramtop:
    case R_RL78_OPromtop:
    case R_RL78_SYM:
      rl78_stack_push (symval, &status);
      break;

    case R_RL78_OPneg:
      tmp1 = rl78_stack_pop (&status);
      tmp1 = - tmp1;
      rl78_stack_push (tmp1, &status);
      break;

    case R_RL78_OPadd:
      tmp2 = rl78_stack_pop (&status);
      tmp1 = rl78_stack_pop (&status);
      tmp1 += tmp2;
      rl78_stack_push (tmp1, &status);
      break;

    case R_RL78_OPsub:
      /* For the expression "A - B", the assembler pushes A,
	 then B, then OPSUB.  So the first op we pop is B, not A.  */
      tmp2 = rl78_stack_pop (&status);	/* B */
      tmp1 = rl78_stack_pop (&status);	/* A */
      tmp1 -= tmp2;		/* A - B */
      rl78_stack_push (tmp1, &status);
      break;

    case R_RL78_OPmul:
      tmp2 = rl78_stack_pop (&status);
      tmp1 = rl78_stack_pop (&status);
      tmp1 *= tmp2;
      rl78_stack_push (tmp1, &status);
      break;

    case R_RL78_OPdiv:
      tmp2 = rl78_stack_pop (&status);
      tmp1 = rl78_stack_pop (&status);
      if (tmp2 != 0)
	tmp1 /= tmp2;
      else
	{
	  tmp1 = 0;
	  status = bfd_reloc_overflow;
	}
      rl78_stack_push (tmp1, &status);
      break;

    case R_RL78_OPshla:
      tmp2 = rl78_stack_pop (&status);
      tmp1 = rl78_stack_pop (&status);
      tmp1 <<= tmp2;
      rl78_stack_push (tmp1, &status);
      break;

    case R_RL78_OPshra:
      tmp2 = rl78_stack_pop (&status);
      tmp1 = rl78_stack_pop (&status);
      tmp1 >>= tmp2;
      rl78_stack_push (tmp1, &status);
      break;

    case R_RL78_OPsctsize:
      rl78_stack_push (input_section->size, &status);
      break;

    case R_RL78_OPscttop:
      rl78_stack_push (input_section->output_section->vma, &status);
      break;

    case R_RL78_OPand:
      tmp2 = rl78_stack_pop (&status);
      tmp1 = rl78_stack_pop (&status);
      tmp1 &= tmp2;
      rl78_stack_push (tmp1, &status);
      break;

    case R_RL78_OPor:
      tmp2 = rl78_stack_pop (&status);
      tmp1 = rl78_stack_pop (&status);
      tmp1 |= tmp2;
      rl78_stack_push (tmp1, &status);
      break;

    case R_RL78_OPxor:
      tmp2 = rl78_stack_pop (&status);
      tmp1 = rl78_stack_pop (&status);
      tmp1 ^= tmp2;
      rl78_stack_push (tmp1, &status);
      break;

    case R_RL78_OPnot:
      tmp1 = rl78_stack_pop (&status);
      tmp1 = ~ tmp1;
      rl78_stack_push (tmp1, &status);
      break;

    case R_RL78_OPmod:
      tmp2 = rl78_stack_pop (&status);
      tmp1 = rl78_stack_pop (&status);
      if (tmp2 != 0)
	tmp1 %= tmp2;
      else
	{
	  tmp1 = 0;
	  status = bfd_reloc_overflow;
	}
      rl78_stack_push (tmp1, &status);
      break;
    }

  if (r)
    {
      if (status == bfd_reloc_dangerous)
	*error_message = (_("RL78 reloc stack overflow/underflow"));
      else if (status == bfd_reloc_overflow)
	{
	  status = bfd_reloc_dangerous;
	  *error_message = (_("RL78 reloc divide by zero"));
	}
      *r = status;
    }
  return relocation;
}

/* Check whether RELOCATION overflows a relocation field described by
   HOWTO.  */

static bfd_reloc_status_type
check_overflow (reloc_howto_type *howto, bfd_vma relocation)
{
  switch (howto->complain_on_overflow)
    {
    case complain_overflow_dont:
      break;

    case complain_overflow_bitfield:
      if ((bfd_signed_vma) relocation < -(1LL << (howto->bitsize - 1))
	  || (bfd_signed_vma) relocation >= 1LL << howto->bitsize)
	return bfd_reloc_overflow;
      break;

    case complain_overflow_signed:
      if ((bfd_signed_vma) relocation < -(1LL << (howto->bitsize - 1))
	  || (bfd_signed_vma) relocation >= 1LL << (howto->bitsize - 1))
	return bfd_reloc_overflow;
      break;

    case complain_overflow_unsigned:
      if (relocation >= 1ULL << howto->bitsize)
	return bfd_reloc_overflow;
      break;
    }
  return bfd_reloc_ok;
}

static bfd_reloc_status_type
rl78_special_reloc (bfd *      input_bfd,
		    arelent *  reloc,
		    asymbol *  symbol,
		    void *     data,
		    asection * input_section,
		    bfd *      output_bfd ATTRIBUTE_UNUSED,
		    char **    error_message)
{
  bfd_reloc_status_type	 r = bfd_reloc_ok;
  bfd_vma		 relocation = 0;
  unsigned long		 r_type = reloc->howto->type;
  bfd_byte *		 contents = data;

  /* If necessary, compute the symbolic value of the relocation.  */
  switch (r_type)
    {
    case R_RL78_SYM:
      relocation = (symbol->value
		    + symbol->section->output_section->vma
		    + symbol->section->output_offset
		    + reloc->addend);
	break;

    case R_RL78_OPromtop:
      relocation = get_romstart (NULL, input_bfd, input_section,
				 reloc->address);
      break;

    case R_RL78_OPramtop:
      relocation = get_ramstart (NULL, input_bfd, input_section,
				 reloc->address);
      break;
    }

  /* Get the value of the relocation.  */
  relocation = rl78_compute_complex_reloc (r_type, relocation, input_section,
					   &r, error_message);

  if (STACK_REL_P (r_type))
    {
      bfd_size_type limit;
      unsigned int nbytes;

      if (r == bfd_reloc_ok)
	r = check_overflow (reloc->howto, relocation);

      if (r_type == R_RL78_ABS16_REV)
	relocation = ((relocation & 0xff) << 8) | ((relocation >> 8) & 0xff);
      else if (r_type == R_RL78_ABS32_REV)
	relocation = (((relocation & 0xff) << 24)
		      | ((relocation & 0xff00) << 8)
		      | ((relocation >> 8) & 0xff00)
		      | ((relocation >> 24) & 0xff));

      limit = bfd_get_section_limit_octets (input_bfd, input_section);
      nbytes = reloc->howto->bitsize / 8;
      if (reloc->address < limit
	  && nbytes <= limit - reloc->address)
	{
	  unsigned int i;

	  for (i = 0; i < nbytes; i++)
	    {
	      contents[reloc->address + i] = relocation;
	      relocation >>= 8;
	    }
	}
      else
	r = bfd_reloc_outofrange;
    }

  return r;
}

#define OP(i)      (contents[rel->r_offset + (i)])

/* Relocate an RL78 ELF section.
   There is some attempt to make this function usable for many architectures,
   both USE_REL and USE_RELA ['twould be nice if such a critter existed],
   if only to serve as a learning tool.

   The RELOCATE_SECTION function is called by the new ELF backend linker
   to handle the relocations for a section.

