ravynsoft/ravynos/gnu/usr.bin/binutils/bfd/elf32-rl78.c
	  case R_RL78_DIR16_REV:
	    OP (1) = relocation;
	    OP (0) = relocation >> 8;
	    break;

	  case R_RL78_DIR3U_PCREL:
	    OP (0) &= 0xf8;
	    OP (0) |= relocation & 0x07;
	    /* Map [3, 10] to [0, 7].  The code below using howto
	       bitsize will check for unsigned overflow.  */
	    relocation -= 3;
	    break;

	  case R_RL78_DIR24S_PCREL:
	    OP (0) = relocation;
	    OP (1) = relocation >> 8;
	    OP (2) = relocation >> 16;
	    break;

	  case R_RL78_DIR24S:
	    OP (0) = relocation;
	    OP (1) = relocation >> 8;
	    OP (2) = relocation >> 16;
	    break;

	  case R_RL78_DIR32:
	    OP (0) = relocation;
	    OP (1) = relocation >> 8;
	    OP (2) = relocation >> 16;
	    OP (3) = relocation >> 24;
	    break;

	  case R_RL78_DIR32_REV:
	    OP (3) = relocation;
	    OP (2) = relocation >> 8;
	    OP (1) = relocation >> 16;
	    OP (0) = relocation >> 24;
	    break;

	  case R_RL78_RH_SFR:
	    relocation -= 0xfff00;
	    OP (0) = relocation;
	    break;

	  case R_RL78_RH_SADDR:
	    relocation -= 0xffe20;
	    OP (0) = relocation;
	    break;

	    /* Complex reloc handling:  */
	  case R_RL78_ABS32:
	  case R_RL78_ABS32_REV:
	  case R_RL78_ABS24S_PCREL:
	  case R_RL78_ABS24S:
	  case R_RL78_ABS16:
	  case R_RL78_ABS16_REV:
	  case R_RL78_ABS16S_PCREL:
	  case R_RL78_ABS16S:
	  case R_RL78_ABS16U:
	  case R_RL78_ABS16UL:
	  case R_RL78_ABS16UW:
	  case R_RL78_ABS8:
	  case R_RL78_ABS8U:
	  case R_RL78_ABS8UL:
	  case R_RL78_ABS8UW:
	  case R_RL78_ABS8S_PCREL:
	  case R_RL78_ABS8S:
	  case R_RL78_OPneg:
	  case R_RL78_OPadd:
	  case R_RL78_OPsub:
	  case R_RL78_OPmul:
	  case R_RL78_OPdiv:
	  case R_RL78_OPshla:
	  case R_RL78_OPshra:
	  case R_RL78_OPsctsize:
	  case R_RL78_OPscttop:
	  case R_RL78_OPand:
	  case R_RL78_OPor:
	  case R_RL78_OPxor:
	  case R_RL78_OPnot:
	  case R_RL78_OPmod:
	    relocation = rl78_compute_complex_reloc (r_type, 0, input_section,
						     &r, &error_message);

	    switch (r_type)
	      {
	      case R_RL78_ABS32:
		OP (0) = relocation;
		OP (1) = relocation >> 8;
		OP (2) = relocation >> 16;
		OP (3) = relocation >> 24;
		break;

	      case R_RL78_ABS32_REV:
		OP (3) = relocation;
		OP (2) = relocation >> 8;
		OP (1) = relocation >> 16;
		OP (0) = relocation >> 24;
		break;

	      case R_RL78_ABS24S_PCREL:
	      case R_RL78_ABS24S:
		OP (0) = relocation;
		OP (1) = relocation >> 8;
		OP (2) = relocation >> 16;
		break;

	      case R_RL78_ABS16:
		OP (0) = relocation;
		OP (1) = relocation >> 8;
		break;

	      case R_RL78_ABS16_REV:
		OP (1) = relocation;
		OP (0) = relocation >> 8;
		break;

	      case R_RL78_ABS16S_PCREL:
	      case R_RL78_ABS16S:
		OP (0) = relocation;
		OP (1) = relocation >> 8;
		break;

	      case R_RL78_ABS16U:
	      case R_RL78_ABS16UL:
	      case R_RL78_ABS16UW:
		OP (0) = relocation;
		OP (1) = relocation >> 8;
		break;

	      case R_RL78_ABS8:
		OP (0) = relocation;
		break;

	      case R_RL78_ABS8U:
	      case R_RL78_ABS8UL:
	      case R_RL78_ABS8UW:
		OP (0) = relocation;
		break;

	      case R_RL78_ABS8S_PCREL:
	      case R_RL78_ABS8S:
		OP (0) = relocation;
		break;

	      default:
		break;
	      }
	    break;

	  case R_RL78_SYM:
	    if (r_symndx < symtab_hdr->sh_info)
	      relocation = sec->output_section->vma + sec->output_offset
		+ sym->st_value + rel->r_addend;
	    else if (h != NULL
		     && (h->root.type == bfd_link_hash_defined
			 || h->root.type == bfd_link_hash_defweak))
	      relocation = h->root.u.def.value
		+ sec->output_section->vma
		+ sec->output_offset
		+ rel->r_addend;
	    else
	      {
		relocation = 0;
		if (h->root.type != bfd_link_hash_undefweak)
		  _bfd_error_handler
		    (_("warning: RL78_SYM reloc with an unknown symbol"));
	      }
	    (void) rl78_compute_complex_reloc (r_type, relocation, input_section,
					       &r, &error_message);
	    break;

	  case R_RL78_OPromtop:
	    relocation = get_romstart (info, input_bfd, input_section,
				       rel->r_offset);
	    (void) rl78_compute_complex_reloc (r_type, relocation, input_section,
					       &r, &error_message);
	    break;

	  case R_RL78_OPramtop:
	    relocation = get_ramstart (info, input_bfd, input_section,
				       rel->r_offset);
	    (void) rl78_compute_complex_reloc (r_type, relocation, input_section,
					       &r, &error_message);
	    break;

	  default:
	    r = bfd_reloc_notsupported;
	    break;
	  }

      if (r == bfd_reloc_ok)
	r = check_overflow (howto, relocation);

      if (r != bfd_reloc_ok)
	{
	  switch (r)
	    {
	    case bfd_reloc_overflow:
	      (*info->callbacks->reloc_overflow)
		(info, (h ? &h->root : NULL), name, howto->name, (bfd_vma) 0,
		 input_bfd, input_section, rel->r_offset);
	      break;

	    case bfd_reloc_undefined:
	      (*info->callbacks->undefined_symbol)
		(info, name, input_bfd, input_section, rel->r_offset, true);
	      break;

	    case bfd_reloc_outofrange:
	       /* xgettext:c-format */
	      (*info->callbacks->einfo)
		(_("%H: %s out of range\n"),
		 input_bfd, input_section, rel->r_offset, howto->name);
	      break;

	    case bfd_reloc_notsupported:
	      /* xgettext:c-format */
	      (*info->callbacks->einfo)
		(_("%H: relocation type %u is not supported\n"),
		 input_bfd, input_section, rel->r_offset, r_type);
	      break;

	    case bfd_reloc_dangerous:
	      (*info->callbacks->reloc_dangerous)
		(info, error_message, input_bfd, input_section, rel->r_offset);
	      break;

	    default:
	      /* xgettext:c-format */
	      (*info->callbacks->einfo)
		(_("%H: relocation %s returns an unrecognized value %x\n"),
		 input_bfd, input_section, rel->r_offset, howto->name, r);
	      break;
	    }
	  ret = false;
	}
    }

  return ret;
}

/* Function to set the ELF flag bits.  */

static bool
rl78_elf_set_private_flags (bfd * abfd, flagword flags)
{
  elf_elfheader (abfd)->e_flags = flags;
  elf_flags_init (abfd) = true;
  return true;
}

static bool no_warn_mismatch = false;

void bfd_elf32_rl78_set_target_flags (bool);

void
bfd_elf32_rl78_set_target_flags (bool user_no_warn_mismatch)
{
  no_warn_mismatch = user_no_warn_mismatch;
}

static const char *
rl78_cpu_name (flagword flags)
{
  switch (flags & E_FLAG_RL78_CPU_MASK)
    {
    default: return "";
    case E_FLAG_RL78_G10:     return "G10";
    case E_FLAG_RL78_G13:     return "G13";
    case E_FLAG_RL78_G14:     return "G14";
    }
}

